app/controllers/usuarios_controller.rb

  def show_all
    @usuarios = Usuario.all
    hash = {'usuarios' => @usuarios, 'total' => @usuarios.count}.to_json
---
SELECT "usuarios".* FROM "usuarios"
SELECT COUNT(*) FROM "usuarios"

  def show
    @usuario = Usuario.find_by_id(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]

  def create_new
    if (params[:id])
      respond_to do |format|
        format.json { render :json => {:error => "No se puede crear usuario con id"}.to_json, :status => 400 }
      end
    else
      @usuario = Usuario.new({"nombre":params[:nombre], "apellido":params[:apellido], "usuario":params[:usuario], "twitter":params[:twitter]})
      respond_to do |format|
      # format.json { render json: {"nombre":params[:nombre], "apellido":params[:apellido], "usuario":params[:usuario], "twitter":params[:twitter]}}
        if @usuario.save
---
INSERT INTO "usuarios" ("nombre", "apellido", "usuario", "twitter") VALUES (?, ?, ?, ?)  [["nombre", "Juan"], ["apellido", "Pérez"], ["usuario", "s"], ["twitter", "jperez1990"]]

  def create
    @usuario = Usuario.new(usuario_params)
    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("usuario", "nombre", "apellido", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["usuario", "Tomas"], ["nombre", "Rencoret"], ["apellido", ""], ["twitter", ""], ["created_at", "2017-03-28 00:02:19.712084"], ["updated_at", "2017-03-28 00:02:19.712084"]]

  def update
    @usuario = Usuario.find_by_id(params[:id])
    if @usuario.nil?
      render :json => {:error => "Usuario no encontrado"}.to_json, :status => 404

      #render :json => {:error => "id no es modificable"}.to_json, :status => 400
    else
      if usuario_params.count==1
        respond_to do |format|
          # format.json { render json: usuario_params.count}
          if @usuario.update(usuario_params)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "usuarios" SET "usuario" = ?, "nombre" = ?, "apellido" = ?, "twitter" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["usuario", "trencoret"], ["nombre", "Tomas"], ["apellido", "Rencoret"], ["twitter", "trencoret.com"], ["updated_at", "2017-03-28 02:23:59.173753"], ["id", 1]]

  def destroy
    @usuario = Usuario.find_by_id(params[:id])
    if @usuario.nil?
      render :json => {:error => "Usuario no encontrado"}.to_json, :status => 404
    else
      @usuario.destroy
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]